package main

import (
	"fmt"
	"goapi/bootstrap"
	"goapi/config"
	"goapi/pkg/helpers"
	"goapi/pkg/logger"
)

func init() {
	// 初始化配置信息
	config.Initialize()
	// 定义日志目录
	logger.Init("test")
	// 初始化 SQL
	bootstrap.SetupDB()
}

func main() {

	// 算法步骤拆分
	// 1、取出初始值，作为线条基数，取出最后值作为线条终点
	// 2、计算该段线条所有的点数
	// 3、初始值与最后的值比较，判断这段时间是涨还是跌
	// 4、从初始值开始，第 （n） 个值与（n+1）一个值进行对比，同时判断是否涨跌，记录中间的涨跌次数，连续涨跌的权重
	// 5、根据涨跌的次数，初始值，末位值分析
	// 5.1、末位值大于初始值：初步认定为涨势，再次根据线条区间的涨跌次数进行计算，涨多跌少的话，认定为斜线上涨，否则为无规律线条
	// 5.2、末位值小于初始值：初步认定为跌势，再次根据线条区间的涨跌次数进行计算，涨少跌多的话，认定为斜线下滑，否则为无规律线条

	//var line = []int{1, 3, 4, 5, 8, 9, 12, 15, 19, 25, 29, 38, 42}
	//var line = []int{100, 93, 150, 74, 68, 50, 43, 390, 29, 16, 8, 1}

	var data = "c_close\n3397.389914\n3397.609843\n3397.563859\n3396.977478\n3396.984147\n3396.986653\n3397.065655\n3397.101102\n3396.996102\n3397.082363\n3397.144172\n3397.146889\n3397.168954\n3397.087732\n3397.127732\n3397.124868\n3397.059868\n3397.069222\n3396.937604\n3396.917073\n3397.114573\n3396.69773\n3396.579135\n3396.62457\n3396.62457\n3396.0911\n3396.0636\n3396.067899\n3396.067899\n3396.052102\n3396.052147\n3396.058591\n3396.336091\n3396.277031\n3396.269531\n3396.292631\n3396.249894\n3396.259253\n3396.257955\n3396.285455\n3396.286753\n3396.286753\n3396.286529\n3396.28121\n3396.25121\n3396.253939\n3396.149148\n3396.078665\n3396.036165\n3396.029793\n3396.044793\n3396.012433\n3396.066902\n3396.001902\n3395.79508\n3394.061921\n3394.044331\n3393.937495\n3393.830817\n3393.820135\n3393.707593\n3393.707593\n3393.707593\n3393.66007\n3393.69359\n3393.773144\n3393.756227\n3393.963727\n3393.963727\n3393.960221\n3393.762721\n3393.724773\n3393.51486\n3393.431933\n3393.434433\n3393.672865\n3393.557865\n3393.298751\n3393.268751\n3393.08155\n3393.08155\n3393.088484\n3393.080984\n3392.997445\n3392.983092\n3392.825341\n3392.167976\n3392.167976\n3392.789922\n3392.769832\n3392.75985\n3392.690843\n3392.678343\n3392.72025\n3392.83525\n3392.539027\n3392.745579\n3392.5352\n3392.394582\n3392.302082\n3391.858676\n3391.347571\n3391.276493\n3391.216493\n3391.198993\n3391.199395\n3391.199395\n3391.261703\n3391.235321\n3391.201614\n3391.091614\n3391.091614\n3390.796927\n3390.790714\n3390.387172\n3390.400672\n3390.384572\n3390.386543\n3390.386543\n3390.321543\n3390.30992\n3390.334965\n3390.339965\n3390.334786\n3390.277812\n3390.368174\n3390.377245\n3390.376172\n3389.941172\n3389.863672\n3389.863717\n3389.849502\n3389.844438\n3389.861849\n3389.80688\n3389.764751\n3389.694562\n3389.492062\n3389.482808\n3389.477808\n3389.244544\n3389.247044\n3389.237953\n3389.285002\n3389.277716\n3388.760216\n3388.721744\n3388.589392\n3388.493238\n3388.449072\n3388.416572\n3388.384988\n3388.348751\n3388.413167\n3388.413167\n3388.262349\n3388.325468\n3388.212968\n3388.293072\n3388.560572\n3388.675389\n3388.670389\n3388.676246\n3388.623746\n3388.623522\n3388.808478\n3389.205978\n3389.213801\n3389.211301\n3389.213842\n3389.213842\n3389.221353\n3389.251353\n3389.281741\n3389.281294\n3389.173794\n3389.114561\n3389.174564\n3389.174564\n3389.183997\n3389.183997\n3389.034619\n3389.164619\n3389.15085\n3389.15322\n3389.00572\n3388.983873\n3388.984097\n3388.981597\n3389.242342\n3389.230675\n3389.230675\n3389.230988\n3389.176552\n3389.242648\n3389.264999\n3389.354347\n3389.304859\n3389.279457\n3389.259457\n3389.319154\n3389.024821\n3389.030477\n3389.000941\n3389.016319\n3388.936319\n3389.024483\n3389.081983\n3389.081983\n3389.082475\n3389.277127\n3389.219716\n3389.243416\n3389.809283\n3389.816834\n3389.879303\n3390.050994\n3390.06615\n3390.10865\n3390.365461\n3390.365067\n3391.150067\n3391.421808\n3391.45378\n3391.411878\n3391.43124\n3391.474943\n3391.488358\n3392.211301\n3392.22351\n3392.303126\n3392.303126\n3392.485903\n3392.485903\n3392.523427\n3392.466208\n3392.487948\n3392.027881\n3392.020039\n3391.887553\n3391.887553\n3391.829591\n3391.741601\n3391.741601\n3391.597542\n3391.78752\n3391.758144\n3391.758144\n3391.799366\n3391.792613\n3391.725113\n3391.725113\n3391.645486\n"
	line := helpers.CloseDataConvert(data)
	logger.Info(fmt.Sprintf("线性数据：%v", line))
	var (
		riseCount         = 0                                              // 涨次数
		fallCount         = 0                                              // 跌次数
		flatCount         = 0                                              // 平次数
		riseRate  float64 = 0                                              // 上涨率
		fallRate  float64 = 0                                              // 下跌率
		flatRate  float64 = 0                                              // 平线率
		result            = 0                                              // 最终涨跌结果 0 不涨不跌，1-涨 2-跌
		desc              = map[int]interface{}{0: "平缓", 1: "上涨", 2: "下跌"} // 描述字段
	)

	// 所有点数
	count := len(line)
	// 初始值
	start := line[0]
	// 最后值
	end := line[count-1]
	logger.Info(fmt.Sprintf("所有数据点数：%v 个点", count))
	logger.Info(fmt.Sprintf("初始值：%v", start))
	logger.Info(fmt.Sprintf("最后值：%v", end))

	// 1、从初始值开始，第 （n） 个值与（n+1）一个值进行对比，同时判断是否涨跌，记录中间的涨跌次数，连续涨跌的权重
	for n := 0; n < (count - 1); n++ {
		difference := line[n+1] - line[n]
		if difference > 0 { // 涨次数累加
			riseCount++
		} else if difference < 0 { // 跌次数累加
			fallCount++
		} else {
			flatCount++
		}
	}

	// 上涨率
	riseRate = float64(riseCount) / float64(riseCount+fallCount)
	// 下跌率
	fallRate = float64(fallCount) / float64(riseCount+fallCount)
	// 平线率
	flatRate = float64(flatCount) / float64(count)

	// 2、初始值与最后的值比较，判断这段时间是涨还是跌
	if end > start { // 初步认定为涨势
		if (riseCount-fallCount) > 0 && ((riseRate - fallRate) > 0.01) { // 涨多跌少的话，认定为斜线上涨，否则为无规律线条
			result = 1
		} else {
			result = 0
		}
	} else if end < start { // 初步认定为跌势
		if (riseCount-fallCount) < 0 && ((fallRate - riseRate) > 0.01) { // 涨少跌多的话，认定为斜线下滑，否则为无规律线条
			result = 2
		} else {
			result = 0
		}
	} else {
		result = 0 // 平缓
	}
	logger.Info(fmt.Sprintf("该时间段数据上涨次数：%v，上涨率：%v", riseCount, riseRate))
	logger.Info(fmt.Sprintf("该时间段数据下跌次数：%v，下跌率：%v", fallCount, fallRate))
	logger.Info(fmt.Sprintf("该时间段数据连平次数：%v，平线率：%v", flatCount, flatRate))
	logger.Info(fmt.Sprintf("该时间段数据最终判定结果：%v", desc[result]))

}
