package main

import (
	"goapi/config"
	"goapi/pkg/logger"
	"time"
)

func init() {
	var cstZone = time.FixedZone("CST", 7*3600) // 东七
	time.Local = cstZone
	// 初始化配置信息
	config.Initialize()
	// 定义日志目录
	logger.Init("undulation")
	// 初始化 SQL
	//bootstrap.SetupDB()
}

func main() {
	for true {
		logger.Info(time.Now().Format("2006-01-02 15:04:05"))
		time.Sleep(time.Second)
	}
	//var data = "c_close\n42397.705\n42397.705\n42397.705\n42397.8775\n42396.27\n42396.9975\n42399.9675\n42399.9675\n42399.9925\n42402.1525\n42403.05\n42403.05\n42402.9775\n42402.9575\n42402.9775\n42402.9775\n42403.75\n42403.775\n42403.7725\n42403.7725\n42403.7725\n42401.5325\n42405.735\n42405.735\n42405.1125\n42405.1125\n42404.385\n42404.385\n42405.1125\n42405.1125\n42405.7425\n42405.7425\n42405.7425\n42405.745\n42407.26\n42407.2625\n42406.88\n42406.88\n42407.4375\n42407.4375\n42408.3625\n42408.3625\n42408.0125\n42408.0125\n42408.3575\n42408.3575\n42408.3575\n42408.3575\n42408.2625\n42408.2625\n42408.99\n42408.99\n42409.49\n42409.1175\n42408.765\n42408.765\n42408.0825\n42408.305\n42408.2275\n42408.6375\n"
	// 算法步骤拆分
	// 1、取出初始值，作为线条基数，取出最后值作为线条终点，
	// 2、计算该段线条所有的点数
	// 3、初始值与最后的值比较，判断这段时间是涨还是跌
	// 4、从初始值开始，第 （n） 个值与（n+1）一个值进行对比，同时判断是否涨跌，记录中间的涨跌数据，算出涨跌波动值，以及涨跌波动平均值
	// 5、根据涨跌的次数，初始值，末位值分析
	// 5.1、末位值大于初始值：初步认定为涨势，再次根据线条区间的涨跌次数进行计算，涨多跌少的话，认定为斜线上涨，否则为无规律线条
	// 5.2、末位值小于初始值：初步认定为跌势，再次根据线条区间的涨跌次数进行计算，涨少跌多的话，认定为斜线下滑，否则为无规律线条
	// 监控K线数据时间段的数据波动，实时调整赔率
	//explainData(helpers.CloseDataConvert(data))
}

// 计算数据
func explainData(lineData []float64) {
	// (一)、上升趋势的波动率计算方法是：在上升趋势中，底部与底部的距离除以底部与底部的相隔时间，取整。
	// 上升波动率=(第二个底部-第一个底部)/两底部的时间距离
	// (二)、下降趋势的波动率计算方法是：在下降趋势中，顶部与顶部的距离除以顶部与顶部的相隔时间，取整。并用它们作为坐标刻度在纸上绘制。
	// 下降波动率=(第二个顶部-第一个顶部)/两顶部的时间距离
	//
	//// 算法步骤拆分
	//// 1、取出初始值，作为线条基数，取出最后值作为线条终点，
	//// 2、收集所有的底部用来计算上升波动率，收集所有的顶部计算下降波动率
	//firstVale := utils.GetFirst(lineData)
	//lastVale := utils.GetLast(lineData)
	//
	//// 去除连平
	//for i := 0; i < len(lineData); i++ {
	//	if i == 0 {
	//
	//	} else {
	//		if lineData[i-1] == lineData[i] {
	//
	//		}
	//	}
	//	fmt.Println(lineData[i])
	//	fmt.Println(i)
	//}
	//
	//logger.Info(firstVale)
	//logger.Info(lastVale)
	logger.Info(time.Now().Format("2006-01-02 15:04:05"))

}
